In [1]:
import pandas as pd

    Pandas having two types of Data Structure 
    (1). Series- > used for 1-D
    (2). DataFrame-> used for 2-D

In [2]:
#series:
h=("AA",'2018-30-12',100,10.2)
s=pd.Series(h)
s

0            AA
1    2018-30-12
2           100
3          10.2
dtype: object

In [3]:
s=pd.Series(h,index=['one','two','three','four'])

In [4]:
s

one              AA
two      2018-30-12
three           100
four           10.2
dtype: object

In [5]:
type(s)

pandas.core.series.Series

 converting to dict to series

In [6]:
dict={'Name':'IBM','Date':'2018-30-12','Share':100,'price':11300}

In [7]:
series=pd.Series(dict)

In [8]:
series

Date     2018-30-12
Name            IBM
Share           100
price         11300
dtype: object

print(series)

In [9]:
fb=['FB','2001-08-02',90,3.2]
fb=pd.Series(fb, index = ['name', 'date', 'shares', 'price'])

In [10]:
fb # Point in tuples by default index are set to 0 .....

name              FB
date      2001-08-02
shares            90
price            3.2
dtype: object

      DataFrame has two different index (i). row-index, (ii) column-index
      most comman way to create a DataFrame is by using the dictionary of equal-lenght list

In [11]:
data={'Name':['ASA','IBM','Google'],
      'Date':['2018-30-12','2014-30-05','2010-20-09'],
      'Shares':[150,175,200],
      'Price':[123.2,172.5,140]}

In [12]:
df=pd.DataFrame(data)

In [13]:
df

         Date    Name  Price  Shares
0  2018-30-12     ASA  123.2     150
1  2014-30-05     IBM  172.5     175
2  2010-20-09  Google  140.0     200

In [14]:
type(df)

pandas.core.frame.DataFrame

In [15]:
# Add column
df['owner']='Unknown'

In [16]:
df

         Date    Name  Price  Shares    owner
0  2018-30-12     ASA  123.2     150  Unknown
1  2014-30-05     IBM  172.5     175  Unknown
2  2010-20-09  Google  140.0     200  Unknown

In [17]:
#change the default index
df.index=['One','two','Three']

In [18]:
df

             Date    Name  Price  Shares    owner
One    2018-30-12     ASA  123.2     150  Unknown
two    2014-30-05     IBM  172.5     175  Unknown
Three  2010-20-09  Google  140.0     200  Unknown

In [19]:
# set index to a particular column
df.set_index('Shares')

              Date    Name  Price    owner
Shares
150     2018-30-12     ASA  123.2  Unknown
175     2014-30-05     IBM  172.5  Unknown
200     2010-20-09  Google  140.0  Unknown

In [20]:
#data can be access using row index and column index
df['Shares'] #column Index

One      150
two      175
Three    200
Name: Shares, dtype: int64

In [21]:
df.index=[0,1,2]

In [22]:
df

         Date    Name  Price  Shares    owner
0  2018-30-12     ASA  123.2     150  Unknown
1  2014-30-05     IBM  172.5     175  Unknown
2  2010-20-09  Google  140.0     200  Unknown

In [23]:
df.loc[0]

Date      2018-30-12
Name             ASA
Price          123.2
Shares           150
owner        Unknown
Name: 0, dtype: object

In [24]:
del df['owner']

In [25]:
df

         Date    Name  Price  Shares
0  2018-30-12     ASA  123.2     150
1  2014-30-05     IBM  172.5     175
2  2010-20-09  Google  140.0     200

In [26]:
df

         Date    Name  Price  Shares
0  2018-30-12     ASA  123.2     150
1  2014-30-05     IBM  172.5     175
2  2010-20-09  Google  140.0     200

In [27]:
df.set_index('Name')

              Date  Price  Shares
Name
ASA     2018-30-12  123.2     150
IBM     2014-30-05  172.5     175
Google  2010-20-09  140.0     200

In [28]:
df.drop('Shares',axis=1)

         Date    Name  Price
0  2018-30-12     ASA  123.2
1  2014-30-05     IBM  172.5
2  2010-20-09  Google  140.0

In [29]:
casts=pd.read_csv('cast.csv')

In [30]:
casts.head()

                  title  year      name   type                character     n
0        Closet Monster  2015  Buffy #1  actor                  Buffy 4  31.0
1       Suuri illusioni  1985    Homo $  actor                   Guests  22.0
2   Battle of the Sexes  2017   $hutter  actor          Bobby Riggs Fan  10.0
3  Secret in Their Eyes  2015   $hutter  actor          2002 Dodger Fan   NaN
4            Steve Jobs  2015   $hutter  actor  1988 Opera House Patron   NaN

In [73]:
casts.tail(5)

,title,year,name,type,character,n
74996,Mia fora kai ena... moro,2011,Penelope Anastasopoulou,actress,Popi voulkanizater,11.0
74997,The Magician King,2004,Tiannah Anastassiades,actress,Unicycle Race Attendant,NaN
74998,Festival of Lights,2010,Zoe Anastassiou,actress,Guidance Counselor,20.0
74999,Toxic Tutu,2016,Zoe Anastassiou,actress,Demon of Toxicity,NaN
75000,Fugitive Pieces,2007,Anastassia Anastassopoulou,actress,Laundry Girl,25.0

 #### filters: By Default if we write the DF name it will gives first 30 and last 20 rows of the file along with complete list of column
        It can be limit by using set_option;

In [32]:
titles = pd.read_csv('titles.csv', index_col=None, encoding='utf-8')

In [33]:
pd.set_option('max_rows',10,'max_columns',10)
#pd.set_option('max_rows', 10, 'max_columns', 10)
titles

                         title  year
0               The Rising Son  1990
1      The Thousand Plane Raid  1969
2             Crucea de piatra  1993
3                      Country  2000
4                   Gaiking II  2011
...                        ...   ...
49995                    Rebel  1970
49996                  Suzanne  1996
49997                    Bomba  2013
49998     Aao Jao Ghar Tumhara  1984
49999               Mrs. Munck  1995

[50000 rows x 2 columns]

In [34]:
len(casts) # gives the total

75001

In [35]:
len(titles)

50000

#### Data operations 
    (i) Row and Colun Selction: Any row or column of the DataFrame can be selected by passing the name of the column or rows.        After selecting one from DataFrame, it becomes one-dimensional therefore it is considered as Series.
   ix: 'ix’ command to select a row from the DataFrame.

In [36]:
t=titles['title']
type(t)

pandas.core.series.Series

In [42]:
t.head()

                     title  year
0           The Rising Son  1990
1  The Thousand Plane Raid  1969
2         Crucea de piatra  1993
3                  Country  2000
4               Gaiking II  2011

In [43]:
titles.ix[0]
#titles.ix[0]

title    The Rising Son
year               1990
Name: 0, dtype: object

In [44]:
after85=titles[titles['year']>1985]

In [45]:
after85.head()

              title  year
0    The Rising Son  1990
2  Crucea de piatra  1993
3           Country  2000
4        Gaiking II  2011
5       Medusa (IV)  2015

Note: When we pass the boolean results to DataFrame, then panda will show all the results which corresponds
to True (rather than displaying True and False), as shown in above code. Further, ‘& (and)’ and ‘| (or)’ can be
used for joining two conditions as shown below

In [46]:
t=titles

In [47]:
movies90=t[(t['year']>1990) & (t['year']<2000)]

In [48]:
movies90

                             title  year
2                 Crucea de piatra  1993
12        Poka Makorer Ghar Bosoti  1996
19                Maa Durga Shakti  1999
24            Conflict of Interest  1993
32                     Der Brocken  1992
...                            ...   ...
49969           Chi mei wang liang  1998
49979  Gagay: Prinsesa ng brownout  1993
49987                I Won't Dance  1992
49996                      Suzanne  1996
49999                   Mrs. Munck  1995

[4288 rows x 2 columns]

#### Sorting

In [58]:
t=titles

In [62]:
#find all movies name as Macbeth
macbeth=  t[t['title'] == 'Macbeth']
macbeth.head() # here data is sorted by index

         title  year
4226   Macbeth  1913
9322   Macbeth  2006
11722  Macbeth  2013
17166  Macbeth  1997
25847  Macbeth  1998

In [64]:
macbeth=  t[t['title'] == 'Macbeth'].sort_index() # By Default 
macbeth.head()

         title  year
4226   Macbeth  1913
9322   Macbeth  2006
11722  Macbeth  2013
17166  Macbeth  1997
25847  Macbeth  1998

####   String operations: various string operation van be performed by .str;

In [ ]:
# Let Search Movies 'Maa'

In [70]:
t[t['title'].str.startswith("Maa")].head(70).sort_values('year')

                          title  year
38880                       Maa  1968
45292             Maa Da Laadla  1969
3046              Maa Aur Mamta  1970
38592        Maata Vaishno Devi  1971
21537     Maayadhaari Krishnudu  1980
...                         ...   ...
35656                     Maaro  2011
23478                  Maanikya  2014
17197             Maa al-Khatar  2016
31890  Maanasaandarapetta Yezdi  2016
38942                MaasMurder  2017

[28 rows x 2 columns]

In [ ]:
#Count Values:

In [ ]:
# Total Number of Occurance can be counted using ‘value_counts()’:

In [72]:
t['year'].value_counts().head() # Total number of Movies Based on the Year

2016    2363
2017    2138
2015    1849
2014    1701
2013    1609
Name: year, dtype: int64